Tekla Open API Reference for Tekla Structures 2025
BoltGroup.ConnectAssemblies Property
 Defines whether to connect a part or an assembly as a secondary part (false) or as a sub-assembly (true).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ConnectAssemblies { get; set; }
Public Property ConnectAssemblies As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace